#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/blackboards/infrastructure/runs/run-Qpc2jnJ3T46K9R8K

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
digitalocean_ssh_key.tara: Refreshing state... [id=38240725]
digitalocean_domain.opentracker: Refreshing state... [id=opentracker.app]
digitalocean_droplet_snapshot.original-main-snapshot: Refreshing state... [id=126133672]
digitalocean_domain.blackboards: Refreshing state... [id=blackboards.pl]
digitalocean_ssh_key.secondary: Refreshing state... [id=38557683]
digitalocean_ssh_key.m2: Refreshing state... [id=38210829]
digitalocean_droplet.secondary: Refreshing state... [id=332540871]
digitalocean_record.ns2: Refreshing state... [id=126390272]
digitalocean_record.ns3: Refreshing state... [id=126390273]
digitalocean_record.ns1: Refreshing state... [id=126390270]
digitalocean_record.opentracker-ns2: Refreshing state... [id=313829953]
digitalocean_record.opentracker-ns3: Refreshing state... [id=313829951]
digitalocean_record.opentracker-ns1: Refreshing state... [id=313829950]
digitalocean_droplet.postgres: Refreshing state... [id=359948759]
digitalocean_record.opentracker-root: Refreshing state... [id=313829952]
digitalocean_project.blackboards: Refreshing state... [id=d006b183-c896-4d41-a341-fb46d729eeb6]
aws_iam_user.personal: Refreshing state... [id=alex.jackson]
aws_iam_policy.iac_deployer: Refreshing state... [id=arn:aws:iam::558855412466:policy/iac-deployer-policy]
aws_s3_bucket.postgres_backups: Refreshing state... [id=postgres-backups-tr1pjq]
aws_s3_bucket.remote_state: Refreshing state... [id=terraform-remote-state-m3rc9k]
aws_iam_access_key.personal: Refreshing state... [id=AKIAYEHTA3LZCH5CBE4Y]
aws_iam_user_login_profile.personal: Refreshing state... [id=alex.jackson]
aws_iam_role.iac_deployer: Refreshing state... [id=iac-deployer]
aws_iam_role_policy_attachment.iac_deployer: Refreshing state... [id=iac-deployer-20230421061924179000000001]
aws_iam_user_policy.personal: Refreshing state... [id=alex.jackson:alex.jackson.policy]
aws_s3_bucket_versioning.remote_state: Refreshing state... [id=terraform-remote-state-m3rc9k]
aws_s3_bucket_versioning.postgres_backups: Refreshing state... [id=postgres-backups-tr1pjq]
aws_s3_bucket.postgres_backups: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_access_key.postgres_backups will be created
  + resource "aws_iam_access_key" "postgres_backups" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + pgp_key                        = <<-EOT
            mDMEZEIvBhYJKwYBBAHaRw8BAQdAH6uzDXu/qjfZ8Da+qVhNJT4zsQVLJZfEwoO863fMzM+0M0FsZXhhbmRlciBKYWNrc29uIDxhbGV4YW5kZXJqYWNrc29uQHByb3Rvbm1haWwuY29tPoiZBBMWCgBBFiEENBWFddoEg2am94gYyqzmw/eoXa0FAmRCLwYCGwMFCQPCZwAFCwkIBwICIgIGFQoJCAsCBBYCAwECHgcCF4AACgkQyqzmw/eoXa3WfgD+P4SmEYWrqcxIPpMWRR9gWBLX7iU0doH1t/oGuWhEiyoBAJ20LujsrDFFe8Aw9dgyM3pZ07I+U5aGpbJyLEXAtfIHuDgEZEIvBhIKKwYBBAGXVQEFAQEHQOrRfaG6AGPd9xWWiQgO3LDLgZi/tAitK/g8VCIWrU9cAwEIB4h+BBgWCgAmFiEENBWFddoEg2am94gYyqzmw/eoXa0FAmRCLwYCGwwFCQPCZwAACgkQyqzmw/eoXa02HwD/V++JOMjmTLeds+ouVcSJ6qCq7Rtb3dIKysCnzqd49ToA/1Fv+vWnbkrJg8gOSeU/qKJPZwfYkBqWwv8ozEIlzFwG
        EOT
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "postgres.backups"
    }

  # aws_iam_user.postgres_backups will be created
  + resource "aws_iam_user" "postgres_backups" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "postgres.backups"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy.postgres_backups will be created
  + resource "aws_iam_user_policy" "postgres_backups" {
      + id     = (known after apply)
      + name   = "postgres.backups.policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::postgres-backups-tr1pjq"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::postgres-backups-tr1pjq/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + user   = "postgres.backups"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

</details>